#Вводные данные:
#example = 'Топинамбур'

#Задача:
#Выполните следующие действия в PyCharm:
#В переменную example запишите любую строку.
example = 'Топинамбур'
print('Исходня строка: '+example)
#Выведите на экран(в консоль) первый символ этой строки.
print('Первый символ строки: '+example[0])
#Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print('Последний символ строки: '+example[-1])
#Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print('Вторая половика строки: '+example[5:])
#Выведите на экран(в консоль) это слово наоборот.
print('Строка наоборот: '+example[::-1])
#Выведите на экран(в консоль) каждый второй символ этой строки.
print('Каждый второй символ строки: '+example[1::2])
