 #Создайте переменные разных типов данных:
 # - Создайте переменную name и присвойте ей значение вашего имени (строка).
Name = "Pavel"
 # - Выведите значение переменной name на экран.
print('Значение переменной: Name = ', Name)
 #  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
Age = 44
 # - Выведите значение переменной age на экран.
print('Значение переменной: Age = ', Age)
 #- Перезапишите в age текущее значение переменной age + новое.
 #Как неверно (просто перезапись на новое число):
 #a = 15
 #a = 17
Age = Age + 5
 # - Выведите измененное значение переменной age на экран.
print('Новое значение переменной: Age = ', Age)
 # - Создайте переменную is_student и присвойте ей значение True (логическое значение).
Is_Student = True
 #- Выведите значение переменной Is_Student на экран.
print('Значение переменной: Is_Student = ', Is_Student)