#Практическое задание по работе в Pycharm - "Переменные"
#Задача:
#Напишите 4 переменных которые буду обозначать следующие данные:
#Количество выполненных ДЗ (запишите значение 12)
home_works_count=12
#Количество затраченных часов (запишите значение 1.5)
hours_count=1.5
#Название курса (запишите значение 'Python')
course_name='Python'
#Время на одно задание (вычислить используя 1 и 2 переменные)
time_one_hw=hours_count/home_works_count
#Выведите на экран(в консоль), используя переменные, следующую строку:
#Курс: Python, всего задач: 12, затрачено часов: 1.5, среднее время выполнения: 0.125 часа.

print('Курс: '+course_name+', всего задач: ',home_works_count,', затрачено часов: ',hours_count,', среднее время выполнения: ',time_one_hw,' часа.')
